// colors.js
const COLORS = {
    emeraldGreen: "#00D474", // Яркий изумрудный (основной акцент)
    darkGreen: "#005F37", // Тёмно-зелёный (фоновый)
    forestGreen: "#007C52", // Лесной зелёный (дополнительный акцент)
    mintGreen: "#B2F5C8", // Мятный зелёный (для подсветки)
    deepGreen: "#00391E", // Глубокий зелёный (очень тёмный фон)
    veryDarkGreen: "#011a0e", // Очень тёмный зелёный (почти чёрный)
    neutralGreenGray: "#08140d", // Нейтральный зеленовато-серый
    lightGreen: "#80E4A8", // Светлый зелёный (декоративные элементы)
    softMint: "#DFF9E5", // Мягкий мятный (бэкграунд, светлые элементы)
    almostWhiteGreen: "#F5FFF9", // Почти белый с лёгким зелёным оттенком (фоны, выделения)

    textLight: "#E6FFEB", // Светлый текст на тёмных фонах
    textGray: "#00735e", // Серо-зелёный текст для подсказок
};

export default COLORS;
